{"meta":{"title":"TinyChen's Blog","subtitle":"A mechanic, writer and coder","description":null,"author":"TinyChen","url":"http://www.tiny777.com"},"pages":[{"title":"[404]","date":"2018-07-16T11:53:54.110Z","updated":"2018-07-16T11:53:54.098Z","comments":true,"path":"404.html","permalink":"http://www.tiny777.com/404.html","excerpt":"","text":""},{"title":"About Me","date":"2018-07-16T10:52:51.400Z","updated":"2018-07-16T10:52:51.400Z","comments":true,"path":"about/index.html","permalink":"http://www.tiny777.com/about/index.html","excerpt":"","text":"这里应该有一段自我介绍，但是我还没想好写什么→_→"}],"posts":[{"title":"禁用笔记本内置键盘","slug":"DISALTKB","date":"2018-02-24T16:00:00.000Z","updated":"2018-07-16T12:17:10.118Z","comments":true,"path":"2018/02/25/DISALTKB/","link":"","permalink":"http://www.tiny777.com/2018/02/25/DISALTKB/","excerpt":"有很多同学会有给笔记本电脑外接键盘的需求， 但是如果直接将外接键盘放到内置键盘上面容易误触，小七在这里跟大家分享一个通过CMD命令禁用笔记本内置键盘的方法。","text":"有很多同学会有给笔记本电脑外接键盘的需求， 但是如果直接将外接键盘放到内置键盘上面容易误触，小七在这里跟大家分享一个通过CMD命令禁用笔记本内置键盘的方法。 禁用首先，以管理员身份运行CMD。 然后输入这条命令： sc config i8042prt start= disabled 重启之后就可以禁用笔记本内置键盘的服务。 恢复需要恢复的话也很简单： sc config i8042prt start= auto 重启之后即可启用笔记本内置键盘的服务。 这个方法的好处在于简单快捷稳定。不需要什么拆机拔笔记本键盘排线，卸载键盘驱动/安装错误键盘驱动等等一系列骚操作。","categories":[{"name":"教程","slug":"教程","permalink":"http://www.tiny777.com/categories/教程/"}],"tags":[{"name":"笔记本","slug":"笔记本","permalink":"http://www.tiny777.com/tags/笔记本/"},{"name":"笔记本键盘","slug":"笔记本键盘","permalink":"http://www.tiny777.com/tags/笔记本键盘/"}]},{"title":"BIOS与UEFI","slug":"BIOS&UEFI","date":"2017-10-06T16:00:00.000Z","updated":"2018-07-16T12:12:44.069Z","comments":true,"path":"2017/10/07/BIOS&UEFI/","link":"","permalink":"http://www.tiny777.com/2017/10/07/BIOS&UEFI/","excerpt":"BIOS和UEFI这两个概念对于刚接触计算机硬件的朋友来说可能有些难以区分，最近正好有空，就稍微整理了一下有关知识和大家分享交流一下，如文中有任何错误不足，还望不吝赐教。","text":"BIOS和UEFI这两个概念对于刚接触计算机硬件的朋友来说可能有些难以区分，最近正好有空，就稍微整理了一下有关知识和大家分享交流一下，如文中有任何错误不足，还望不吝赐教。 BIOS ▲图为经典BIOS操作界面 简介BIOS，读作/‘baious/，全称Basic Input Outpout System（基本输入输出系统），本质上是一组固化到计算机内主板上一个ROM芯片上的程序，它保存着计算机最重要的基本输入输出的程序、开机后自检程序和系统自启动程序，它可从CMOS中读写系统设置的具体信息。BIOS和手机的Bootloader有些相似，实际上，不止是电脑和手机，基本所有电子产品都有与BIOS/Bootloader功能相似的部分，它们往往体积很小（最大的也才几MB），功能看似简单但是非常重要。 存储上，在主板中有着专门的芯片（BIOS芯片/CMOS RAM）用于存储BIOS，因此它并不存储在内存或者硬盘中，稳定性和可靠性有较好的保证。 BIOS的存储介质早期的BIOS是存储在ROM（Read-Only-Memory，只读存储器）芯片中，在主板出厂前，需要通过特殊的手段将BIOS烧录进BIOS芯片中。而且由于ROM的只读特性，一方面保证了BIOS不会受到轻易更改而保证硬件的正常稳定运行，另一方面也限制了BIOS的升级（ROM不能被写入数据）。 不能被升级的BIOS显然不能迎合科技发展的需要，于是EPROM芯片开始替代ROM成为BIOS的存储芯片。 EPROM全程是Erasable Programmable ROM，名为可擦除可编程ROM，这种芯片可重复擦除和写入，解决了ROM芯片只能写入一次的弊端。EPROM内资料的写入要用专用的编程器，并且往芯片中写内容时必须要加一定的编程电压，写入资料后，还要以不透光的贴纸或胶布把窗口封住，以免受到周围的紫外线照射而使资料受损。 尽管EPROM可以重复擦除和写入，但是操作方式和条件都过于苛刻，后来就使用了EEPROM芯片。EEPROM（Electrically Erasable Programmable ROM，电可擦除可编程ROM）。通过跳线开关和系统配带的驱动程序盘，可以对EEPROM进行重写，方便地实现BIOS升级。 到了现在，我们可以用软件轻易地升级BIOS，是因为现在的BIOS大多是使用了NOR Flash。NOR Flash 的特点是芯片内执行（XIP ，eXecute In Place），这样应用程序可以直接在Flash闪存内运行，不必再把代码读到系统RAM中。 NOR 的传输效率很高，在1~4MB的小容量时具有很高的成本效益，但是很低的写入和擦除速度大大影响到它的性能。尽管如此，对于BIOS来说，小容量足以满足需求，而BIOS的升级并非常事，偶尔一次升级，由写入擦除速度慢导致的升级时间延长也没有太大的影响。 BIOS里面有什么一般来说，人们普遍认为BIOS是沟通软件与硬件的桥梁。讲完存储介质，我们再来了解一下这个存储芯片（BIOS芯片）里面都储存着什么东西。 ●自诊断程序：通过读取CMOSRAM中的内容识别硬件配置，并对其进行自检和初始化； 这就是电脑开机最开始的自检步骤，一般出现错误主板会报警，发出响声，一般可以根据响声的长短和数量来判断出现问题的部分，当然也有一些主板在上面加了一块小型的LED显示屏，通过上面的数字来直接反馈错误信息。 ● CMOS设置程序：这个部分就是大家通常见到的BIOS（蓝色背景界面）， 引导过程中，用特殊热键启动（一般是Del、esc、F9、F12等），进行设置后，存入CMOS RAM中； 大多数的电脑停留在这个部分的时间并不长，因此想要进入BIOS的CMOS设置程序，需要在一开机就不停地按对应的特殊热键，错过了这个时间段就只能重启再来。 ● 系统自举装载程序：在自检成功后将磁盘相对0道0扇区上的引导程序（即MBR分区表）装入内存，让其运行以装入操作系统。 ● 主要I/O设备的驱动程序和中断服务：由于BIOS直接和系统硬件资源打交道，因此总是针对某一类型的硬件系统，而各种硬件系统又各有不同，所以存在各种不同种类的BIOS，随着硬件技术的发展，同一种BIOS也先后出现了不同的版本。 UEFI简介由于BIOS是使用汇编语言进行编写，因此在操作界面上相对比较简陋（没有做出太多的图形化界面），对于技术人员来说维护升级也比较麻烦，不可能使用鼠标操作，更加别说截图之类的功能了。 更致命的是，BIOS已经存在了二十多年，可是其发展却是极度缓慢，已经阻碍到了与其相关的硬件的发展，首当其冲的就是CPU。至此，个人PC行业消费市场的龙头老大英特尔坐不住了，由它主导，开始推广一种名为EFI的技术，旨在用其取代传统的BIOS。 小七注：在x86系列处理器进入32位的时代，由于兼容性的原因，新的处理器(i80386)保留了16位的运行方式(实模式)，此后多次处理器的升级换代都保留了这种运行方式。甚至在含64位扩展技术的至强系列处理器中，处理器加电启动时仍然会切换到16位的实模式下运行。英特尔将这种情况归咎于BIOS技术的发展缓慢。自从PC兼容机厂商通过净室的方式复制出第一套BIOS源程序，BIOS就以16位汇编代码，寄存器参数调用方式，静态链接，以及1MB以下内存固定编址的形式存在了十几年。虽然由于各大BIOS厂商的努力，有许多新元素添加到产品中，如PnP BIOS，ACPI，传统USB设备支持等等，但BIOS的根本性质没有得到任何改变。这迫使英特尔在开发更新的处理器时，都必须考虑加进使效能大大降低的兼容模式。有人曾打了一个比喻：这就像保时捷新一代的全自动档跑车被人生套上去一个蹩脚的挂档器。——摘自百度百科 EFI（Extensible Firmware Interface）的中文名一般叫做可扩展固件接口，是一种由英特尔主导的用于替代BIOS的方案。有人称EFI是“未来的类PC的电脑系统中替代BIOS的升级方案”，但实际上，这种说法有一些不太严谨，因为EFI已经被弃用，如今使用的是基于EFI标准1.10版本发展而来的UEFI标准。 如今UEFI早已经普及开来，近些年发售的主板（包括笔记本）基本都支持UEFI和BIOS两种解决方案，前者一般被称为UEFI，后者则称为Legacy。 那么为什么EFI的前面会多了一个U，变成UEFI了呢？实际上，EFI可以被理解为是在BIOS和UEFI过渡时期的产物。 当传统的BIOS（Legacy BIOS）阻碍了计算机硬件发展的时候，英特尔主导推行EFI标准，但是其他企业自然不会那么傻，让英特尔一人主导了整个EFI标准，正所谓“一流企业卖标准”，由Intel, AMD, American Megatrends, Apple, Dell, Hewlett Packard Enterprise, HP，IBM, Insyde Software, Lenovo, Microsoft 和Phoenix Technologies这12家计算机软硬件和零售的巨头在2005年联合成立了一个名为Unified Extensible Firmware Interface Forum（简称Uefi Forum）的非营利性组织，专门负责制定和管理新一代的EFI标准，随后就基于最后一版的EFI标准（1.10）发布了全新的UEFI标准，EFI也就“变”成了UEFI（全称“统一的可扩展固件接口”，Unified Extensible Firmware Interface）。 ▲图为UEFI协会的Logo UEFI的优势那么相对于传统的BIOS，UEFI的优势在哪里呢？ 首先，与使用汇编语言编写的传统BIOS不同，UEFI使用C语言编写，因此整体风格上也就延续了C语言风格的参数堆栈传递和动态链接，模块化特征显著。使用C语言开发和维护对于技术人员来说也方便了很多，更容易实现更强的健壮性和容错性。 UEFI内置图形驱动功能，可以提供一个高分辨率的图形化界面，用户进入后完全可以像在Windows系统下那样使用鼠标进行设置和调整，操作上更为简单快捷。同时由于UEFI在逻辑上可分为硬件控制与软件管理两部分，前者属于标准化的通用设置，而后者则是可编程的开放接口，因此主板厂商可以借助后者的开放接口在自家产品上实现各种丰富的功能，包括截图、数据备份 、硬件故障诊断、脱离操作系统进行UEFI在线升级等，功能上也要比传统BIOS更多、更强。 小七注：UEFI可以识别FAT/FAT32文件系统格式的U盘，因此可以通过特殊热键将截图存储在U盘中或者是将UEFI的设置导出到U盘中进行备份，还可以将升级文件放入U盘中进行UEFI系统的升级，部分高端的主板甚至可以直接在UEFI环境下联网升级。 UEFI的组成 ▲UEFI在逻辑上可分为软件和硬件两个部分 UEFI在概念上可以分为平台初始化框架和UEFI Image两大部分，细分下来则由初始化模块（Pre EFI，简称PEI）、驱动执行环境（DXE）、驱动程序（UEFI Drivers）、兼容性支持模块（CSM）、UEFI应用（UEFI Applications）和GUID磁盘分区（GPT分区）/ OS Loaders组成。 初始化模块和驱动执行环境是UEFI的运行基础，通常被整合在主板的闪存芯片中，这点与传统BIOS是比较类似的。而这两者也被归属在UEFI的平台初始化框架中。 驱动程序、兼容性支持模块、UEFI应用和GUID磁盘分区则归属于UEFI Image。 ▲图为UEFI各部分组件之间的交互逻辑 ●初始化模块：开机的时候初始化模块首先得到执行，负责CPU、主板芯片及存储设备的初始化工作。 ●驱动执行环境：初始化完成后则载入驱动执行环境，即Driver Execution Environment，简称DXE，DXE是硬件的UEFI驱动程序加载和运行的必要基础环境。 ●驱动程序：DXE通过枚举的方式加载各种总线及设备的驱动，而这些驱动程序则可以放置在系统的任意位置，只要确保其可以按顺序被正确枚举即可。硬件的UEFI驱动一般是放置在硬盘的UEFI专用分区中，只需要系统正确加载这个硬盘，对应的驱动就可以正常读取并应用 ●兼容性支持模块：兼容性支持模块（CSM）是有点特殊的过渡时期的产物，是为了让不具备UEFI引导功能的操作系统也能在UEFI环境下顺利完成引导开机，这个兼容性支持模块将为UEFI提供类似于传统BIOS的系统服务，以此保证UEFI在技术上能有良好的过渡。 小七注：Windows操作系统在vista之后均已支持UEFI启动，而需要实现UEFI启动，还需要主板支持，且硬盘分区表要是GPT分区表，此三者缺一不可，缺一都要使用CSM才可以正常开机进入操作系统。 ●UEFI应用：硬件初始化完，操作系统启动之前的核心应用，比如：启动管理（多硬盘多系统的启动顺序）、BIOS设置、UEFI Shell、诊断程式、调度和供应程式、调试应用、包括CPU的超频，主板散热风扇的转速等等都可以在这里控制。 ▲图为UEFI Shell ●GUID磁盘分区/ OS Loaders：GPT分区表作为UEFI标准中不可或缺的重要一环，突破了老旧的MBR分区表最大仅支持2TB硬盘，四个主分区、分区表容易丢失等不足，补足了UEFI启动三要素（主板、硬盘分区表、操作系统）中硬盘分区表这关键的一环。 UEFI的未来UEFI有着如此多的好处，不仅收到了广大电脑用户的喜爱，同时也受到了……额……一些居心叵测的人的喜爱。由于UEFI使用C语言编写，在难度上较汇编语言降低了很多，因此容易遭到黑客的破解或者是恶意软件的植入，加上UEFI强大的应用能力（相对BIOS而言），在UEFI搞一个恶意软件什么的不是美滋滋？ 尽管如此，UEFI依然是目前的主流趋势。","categories":[{"name":"科普","slug":"科普","permalink":"http://www.tiny777.com/categories/科普/"}],"tags":[{"name":"3C","slug":"3C","permalink":"http://www.tiny777.com/tags/3C/"},{"name":"硬件","slug":"硬件","permalink":"http://www.tiny777.com/tags/硬件/"}]},{"title":"MBR分区表","slug":"MBR","date":"2017-08-07T16:00:00.000Z","updated":"2018-07-10T15:33:03.606Z","comments":true,"path":"2017/08/08/MBR/","link":"","permalink":"http://www.tiny777.com/2017/08/08/MBR/","excerpt":"目前来说，比较主流的两种硬盘的分区表是MBR和GPT（GUID）。今天小七带大家了解一下比较旧一点的MBR分区表（相对于GPT）。","text":"目前来说，比较主流的两种硬盘的分区表是MBR和GPT（GUID）。今天小七带大家了解一下比较旧一点的MBR分区表（相对于GPT）。 本文越往后的部分难度越大，各位看官老爷可根据自己的实际需要阅读。 简介MBR这个概念首次出现，是在1983年的IBM PC DOS 2.0操作系统当中，因此也被称为DOS分区结构。实际上，MBR分区结构是一种应用非常广泛的硬盘分区结构，不仅仅是DOS，包括windows系列操作系统、Linux以及基于X86架构的UNIX操作系统等平台均有使用。 MBR的英文全称是Main Boot Record（一说Master Boot Record），翻译过来的中文名称是主引导记录。 它主要有以下几个特点： 1、在我们常见的电脑中，一般是BIOS+MBR、(U)efi+GPT的组合； 2、MBR分区表中单个分区最大仅支持2TB，而整个分区表最大也是仅支持2TB的硬盘； 3、MBR分区表最大只支持四个主分区（可少不可多），如果觉得四个不够用，可以使用三个主分区+一个扩展分区的组合（扩展分区仅能存在一个，但扩展分区下可以分出无数个逻辑分区）； ▲图为MBR分区常见的两种组成 结构MBR分区表占用一个扇区，位于硬盘的0磁头、0柱面、1扇区。 这里需要引用一下度娘百科对于磁头柱面扇区这三个概念的解释。 磁头(Heads)：每张磁片的正反两面各有一个磁头，一个磁头对应一张磁片的一个面。因此，用第几磁 头就可以表示数据在哪个磁面。 柱面(Cylinder)：所有磁片中半径相同的同心磁道构成“柱面”，意思是这一系列的磁道垂直叠在一起，就形成一个柱面的形状。简单地理解，柱面数=磁道数。 扇区(Sector)：将磁道划分为若干个小的区段，就是扇区。虽然很小，但实际是一个扇子的形状，故称为扇区。 ▲图为磁头、柱面、扇区示意图 ①不管是CHS寻址还是LBA寻址，都需要知道磁头柱面和扇区来对数据进行定位； ②通常来说，一个扇区的大小为512字节（Byte）； ③该扇区为隐藏扇区，实际上，0磁头0柱面的扇区均为隐藏扇区，一般的硬盘访问命令无法访问，因此MBR分区表放在此处比较安全，不容易遭到破坏，同理，许多病毒也会隐藏在这里，不容易被查杀。 由于MBR扇区中大部分都被MBR所占领，因此这个扇区就被称为MBR扇区。而MBR扇区主要是由MBR、DPT和结束标识三个部分组成。 ▲图为标准MBR结构 工作原理MBR的产生并不依赖于任何一个操作系统，在电脑开机通电后，BIOS进行自检，自检完成后就开始执行MBR中的启动代码（Bootloader），通过读取启动代码来确定需要引导的系统。因此，双系统或者是多系统安装完成之后，需要修改引导启动项，即为修改此处的启动代码（Bootloader）。 执行完启动代码之后，系统下一步就会读取MBR扇区中的最后两个字节，如果是55AA，则继续读取磁盘分区表DPT来确定是否有活动分区，从而启动系统；如果不是55AA，系统会认为该MBR为非法MBR，系统将停止操作并报错。 ▲图为MBR分区表的硬盘开机过程 这里再额外提一下。 MBR中的选用磁盘标识，这个在MBR分区中比较重要。如果安装的是windows操作系统的话，系统在启动时需要依赖该磁盘签名来识别硬盘并确定该磁盘是否初始化。 而DPT的作用其实非常简单，就是管理磁盘的分区信息。如果DPT被破坏，那么系统将无法识别该磁盘上的所有分区，并且有可能会提示需要格式化磁盘。 一般小白遇到这种情况会比较无奈，只能格式化，对磁盘中宝贵的数据说拜拜，但是，其实只要修复DPT，就可以读取分区，找回数据，实际上，硬盘的数据一直都在那里。那怕是对硬盘进行一般的格式化操作，也只是将DPT中对应的分区的数据清空，并没有影响到原来的在其他扇区的数据，此时只要不进行数据的读写操作（防止覆盖原有数据），还是有可能找回丢失的数据的。 DPTDPT其实有挺多可以讲的地方，这里拿一个分区（16Byte）为例，讲解一下MBR分区最大只能识别2TB硬盘的原因。 分区项表内容及含义注：1 Byte=8 bit ▲图为MBR中的DPT的分区项表的内容及含义 再对其作进一步的解释： 第1字节的引导标识：如果该分区内安装了操作系统，则该分区必须为活动分区，方可成功引导该分区内的操作系统（即为80H）； 第5字节的分区类型符：记录该分区的类型，每一种类型都有一个对应的值，如00H——表示该分区未用（即没有指定，DOS和win不识别该类型分区）、06H——FAT16分区；0BH——FAT32分区、 07H——NTFS分区等； 第2、3、4、6、7、8字节：记录了这个分区的起始和结束磁头、扇区、柱面，即可确定该分区在硬盘中的位置以及该分区的容量； 最后的8个字节就是MBR分区为何最大只能识别2TB容量的原因了。 前提知识背景： ① 计算机中采用2进制，bit是最小的大小计量单位； ② 1 Byte=8 bit； ③ 一个扇区的大小是512Byte； ④ Byte、KB、MB、GB、TB、PB这六者按照从小到大的顺序排列，且相邻两者间差1024倍（即2^10）； ⑤ 在上面的缩写中，大写的B表示Byte，小写的b表示bit，两者相差8倍； 由于只有4 Byte来记录本分区的总扇区数，4 Byte=32 bit，在2进制即有2^32种状态，假设全部为1，则最多有2^32个扇区。即 所以MBR分区中单个分区最多只能识别2TB容量，而由于记录已使用的扇区的字节数也是4，所以整个分区最多也只能识别2TB容量。 扩展分区前面我们已经提到了当四个主分区无法满足需求的时候，可以使用三个主分区+一个扩展分区的方法，在扩展分区下，理论上可以分出无数个分区（实际还要看操作系统的限制等其他因素）。 这里还要介绍一个概念——EBR（Extended Boot Record），即扩展分区引导记录。其原理和工作模式与MBR非常相似，但它是链式的，也就是说一个EBR不够用，可以再增加一个，新增加的EBR链接在旧的EBR之后，一个链接着一个，就像链条一样。理论上就可以实现无数个分区。 MBR分区表的内容介绍到这里就结束了，如果对它还有兴趣的话，或者觉得这里的介绍太过简单的话，可以去查询一些相关书籍和论坛。另外，如果文中有任何错误，还望不吝赐教。","categories":[{"name":"科普","slug":"科普","permalink":"http://www.tiny777.com/categories/科普/"}],"tags":[{"name":"硬盘","slug":"硬盘","permalink":"http://www.tiny777.com/tags/硬盘/"}]},{"title":"Filqlo时钟屏保","slug":"Filqlo","date":"2017-07-02T16:00:00.000Z","updated":"2018-07-10T12:03:52.293Z","comments":true,"path":"2017/07/03/Filqlo/","link":"","permalink":"http://www.tiny777.com/2017/07/03/Filqlo/","excerpt":"不知道大家现在还有没有使用屏保的习惯，反正小七是有的。毕竟在挂机下载，或者是写作业需要开着电脑的时候，开着屏保还是相当不错的。 今天小七就给大家安利一款在Windows平台上免费的屏保软件吧。（苹果系貌似现在也免费了）","text":"不知道大家现在还有没有使用屏保的习惯，反正小七是有的。毕竟在挂机下载，或者是写作业需要开着电脑的时候，开着屏保还是相当不错的。 今天小七就给大家安利一款在Windows平台上免费的屏保软件吧。（苹果系貌似现在也免费了） 话不多说，咱们进入正文。 Filqlo简介 Fliqlo原本是一款在iOS应用商店里面的付费时钟屏保软件，但是由于其复古简单的设计，迅速吸引了一大波粉丝，现在也有了Windows版本和Mac版本。 他们的官网是fliqlo.com，需要科学上网才能正常访问。有兴趣的童鞋可以去他们的官网看看。 下面搬运一小部分他们官网的介绍。 Fliqlo for iOS is a clock app that allows you to make your mobile/tablet device screen look like a flip clock. Thanks to its visibility, you can read the time even from a distance. FeaturesEnlarge/reduce to any size Switch between 12/24 hour clock (* without a leading zero) Switch between portrait and landscape mode Price$0.00 Free for charge 小七注：windows平台的版本并不需要收费，因此大家可以放心下载，如果想支持开发者的话，可以通过它们网站下方的paypal来进行捐赠。 设置教程Mac &amp; IOS对于iOS和Mac平台的用户，直接打开AppStore输入关键字Fliqlo下载安装即可使用。Mac用户也可以去官网下载。 Windows至于Windows的用户就稍稍麻烦一些，需要科学上网到他们的官网进行下载。 为了方便大家使用，小七已经将windows版本从官网搬运过来，点击这里即可下载。 链接：https://pan.baidu.com/s/1eROCql0 密码：7w2w 下载完成之后，我们直接双击打开。就会弹出windows中的屏幕保护程序的设置界面。 我们点击设置，可以看到有几个简单的参数可以进行修改。 它们分别是调节12/24小时制，放大和缩小（最大125%）和恢复默认设置。 ▲默认设置 ▲放大到125%（最大） ▲切换为24小时制 小七注：由于windows平台是免费的，所以BUG的存在也是不可避免的，初次设置的时候可能会出现崩溃的情况，但是只要重启一下电脑就可以解决。（只是初次设置时可能需要重启，不是每次都要重启） 虽然Fliqlo在功能上没有之前很火的Wallpaper Engine那么强大，但是它几乎不占用系统资源且在安装上要简单不少。 玩腻了Wallpaper Engine的同学，确定不来一个Fliqlo试试吗？","categories":[{"name":"分享","slug":"分享","permalink":"http://www.tiny777.com/categories/分享/"}],"tags":[{"name":"屏保","slug":"屏保","permalink":"http://www.tiny777.com/tags/屏保/"}]},{"title":"电脑的AB盘去哪了？","slug":"DiskAB","date":"2017-05-11T16:00:00.000Z","updated":"2018-07-16T12:18:34.510Z","comments":true,"path":"2017/05/12/DiskAB/","link":"","permalink":"http://www.tiny777.com/2017/05/12/DiskAB/","excerpt":"今天聊一个很怀旧的话题。 相信很多人都知道我们的电脑是从C盘开始的，C盘也就是我们平时说的系统盘。 很多人可能会好奇，为什么要从C盘开始，而不是从A盘开始？A盘和B盘去哪了？","text":"今天聊一个很怀旧的话题。 相信很多人都知道我们的电脑是从C盘开始的，C盘也就是我们平时说的系统盘。 很多人可能会好奇，为什么要从C盘开始，而不是从A盘开始？A盘和B盘去哪了？ 其实要解释的话，一句话就够了。AB这两个盘符是预留给软驱的。换句话说， AB盘是计算机发展初期给软驱留的位置。 下面是讲故事时间。 System 370大概是在20世纪70年代初，准确来说是1970年6月30日的样子，IBM推出了System360的继任者——System 370。 ▲System/370 Model 145（图片来源于IBM官网） 关于System370的功能进步小七就不在这里赘述，有兴趣的童鞋可以打开IBM官网输入System370进行搜索既可查看相关信息。 但是IBM的System370计算机面临这样一个问题，就是这种计算机的操作指令存储在半导体内存中，一旦计算机关机，指令便会被抹去。 这句话是什么意思呢？ 说白了就是这种电脑并没有我们现在意义上的硬盘（ROM），它只有半导体内存（RAM），因此只能将数据都存储到半导体内存中。而我们都知道，RAM是断电不保存数据的，也就是说，万一一个不小心重启一下电脑或者是断电了，你辛辛苦苦写了几天几夜的代码就没了…… 想象一下你在办公室奋战几天几夜，赶在DDL之前把代码写了出来，然后累到在办公室睡着了，结果那晚就断电了，第二天PM找你要代码，好家伙，你要怎么办？ 8英寸软盘IBM当然也意识到了这个问题，所以早在1967年，IBM的SanJose实验室的存储小组受命开发一种廉价的设备，为大型机处理器和控制单元保存和传送微代码。这种设备成本必须在5美元以下，以便易于更换，而且必须携带方便，于是软盘的研制之路开始了。 研发组：又要便宜又要便携，你咋不上天呢？ 这个其实可以算是现代的软盘驱动器的鼻祖，但是在携带形式上又有点像U盘等移动存储介质。事实上，在当时计算机的体积没有达到足够小以至于能满足人们便携的时候，这种方式确实是最靠谱也是最保险的。想象一下：一个程序猿把自己花高价买来的DOS系统装到软驱里面，然后再把自己花了毕生精力写的代码放到软驱里面，然后这很可能就是这个程序猿最大的财富了。 乍一想，怎么有点武功秘诀的感觉？ 1971年，还在IBM推出了第一款8英寸的软盘，这是一种直径8英寸的表面涂有金属氧化物的塑料质磁盘，这个就是真正意义上的现代软盘驱动器的鼻祖了。 ▲图为8英寸软盘（图片来源见水印） 磁盘之父——Alan Shugart事实上，软盘的成功推出并没有我们字面上理解的这么简单，其实早在20世纪50年代时，IBM公司董事长小托马斯·沃森迅速把事业扩展到美国西海岸，下令在加利福尼亚圣何塞市附近新建实验室和工厂。约翰逊带领着30多名青年工程师，在不到三年时间，就为IBM创造了引人注目的技术成果——磁盘存储器。在约翰逊领导IBM圣何塞实验室研制硬盘的过程中，一位名叫Alan Shugart的青年工程师发挥了关键作用。 实际上，Alan Shugart也是一个硅谷的传奇人物，年幼家贫的他曾经三度创业，并且两度被自己公司的董事会扫地出门，其中就包括了著名的希捷公司（全球最大的PC硬盘制造商之一）。尽管如此，这位令人敬佩的前辈还是保持着对生活的热爱，实在是值得我们学习。 后来因为Alan Shugart对于磁盘的杰出贡献，人们亲切地称呼他为磁盘之父。 ▲Alan Shugart 5.25英寸软盘上面说到的Alan Shugart，不久后就离开了IBM，并且创办了一家名为Shugart Associates的公司。没错，就是用他自己的名字命名的公司。 当时Alan Shugart和其他几位联合创始人的目标就是打造一家出色的八英寸软盘驱动器制造公司。因为，当时软盘驱动器制造工业刚刚起步，而且这项技术是IBM公司的薄弱环节。于是，他们就决定以此为契机大干一场。 但是，8英寸软盘虽然便携，始终还是大了些。后来他们就推出了5.25英寸的软盘。 ▲如图从左往右以此为3.5/5.25/8英寸软盘（图片来源见水印） 3.5英寸软盘5.25英寸的软盘虽然从体积到容量上都有了一定的进步，但它还是有很多缺点，比如软盘采用的外包装比较脆弱，容易损坏，体积也比较大。因此很多厂家并没有满足于这种软盘，他们都在不断地进行探索，以寻求更为先进的软盘。 新一代软盘的开发终于被日本的索尼公司拔得头筹。 1980年，索尼公司率先推出体积更小、容量更大的3.5英寸软驱和软盘，不过刚推出的时候在当时并没有被一些主要PC厂家所接受，市面上流行的依旧是5.25英寸的软盘。 1982年，微软基于索尼的3.5英寸软盘标准制定了统一的行业标准。 但是标准制定了是一回事儿，人家用不用就是另外一回事儿了。关于3.5英寸软盘的普及，这里我们还要提一下苹果公司。 1984年，苹果推出的麦金塔（Macintosh）电脑，根本就不存在5.25英寸软盘接口这种东西，直接就上了3.5英寸的软盘接口。这个能不能算是帮忙普及小七还真的说不准，但是至少可以说明苹果在换接口这件事上还是不遗余力的。 2016款MacBookPro：喵喵喵？ 为什么要占用AB两个盘符而不是A一个？ 这个说起来就有点扎心了。当年的软盘容量普遍不大，一般都是几十KB。后来大的有几MB。 那么我们说回一开始软盘容量还是几十KB的时候。假设只有一个软盘接口，然后你需要从一张软盘复制数据到另一张软盘上，你只能先将数据复制到半导体内存（RAM）中，然后拔出第一张软盘再插入另一张软盘完成复制。 那么现在问题来了： 假设我要一次复制60KB的数据，而RAM只有32KB那怎么办？ 额……好吧，那就给你两个软盘接口吧。 还有一说是随着操作系统的发展，一些指令不能像以前那样将其从软盘中存放到RAM中操作，因此需要额外读取操作数据的时候只能再多加一个软盘接口。 不管怎么说，两个软盘接口在某些时候总是比一个要方便很多的。 硬盘驱动器人的野心是永远没有办法满足的，不然就不会有科技的进步这一回事儿了。硬盘当然是越大越好，很快人们就发明了存储容量更大的硬盘驱动器（即为我们现在用的机械硬盘），硬盘驱动器也很快凭借其容量大，速度快的优势获得了广大人民群众的喜爱和支持。 但是，早期的硬盘驱动器只能作为软盘的“从属”。 这是什么意思呢？就是说硬盘驱动器刚出来的时候，操作系统还是装在软盘上面的，开机还是得要像之前那样，先插入软盘，然后开机，电脑从软盘中读取数据进行操作，硬盘还是不能当作启动盘的。所以硬盘驱动器的盘符就是从C开始的。 然而随着技术的发展，到了MS-DOS 5.0时代，微软官方钦定了C盘作为系统的启动盘/主硬盘。 随后，软盘渐渐地被淘汰，但是AB这两个盘符还是为他们空出来了。 2006年，Alan Shugart因心脏病手术失败而永远离开了我们。","categories":[{"name":"杂谈","slug":"杂谈","permalink":"http://www.tiny777.com/categories/杂谈/"}],"tags":[{"name":"硬盘","slug":"硬盘","permalink":"http://www.tiny777.com/tags/硬盘/"},{"name":"历史","slug":"历史","permalink":"http://www.tiny777.com/tags/历史/"}]},{"title":"安卓刷机基础","slug":"Android","date":"2017-05-06T16:00:00.000Z","updated":"2018-07-16T11:37:46.825Z","comments":true,"path":"2017/05/07/Android/","link":"","permalink":"http://www.tiny777.com/2017/05/07/Android/","excerpt":"正所谓“想要刷机刷得好，基础知识不能少”。对于想要折腾安卓的童鞋来说，刷机入门的门槛还有有点高的，因此小七整理了一些常见的概念，希望能给大家一些帮助。","text":"正所谓“想要刷机刷得好，基础知识不能少”。对于想要折腾安卓的童鞋来说，刷机入门的门槛还有有点高的，因此小七整理了一些常见的概念，希望能给大家一些帮助。 什么是安卓刷机？刷机，就是通过一定的技术手段向安卓手机中刷入ROM的过程。那么随着刷机的不断发展，刷入的东西类型也在逐渐增多，包括REC、ROM、内核甚至是基带固件等等。 刷机方式都有哪些？目前来说，主流的刷机方式基本可以分为两种：线刷和卡刷。线刷和卡刷最大的区别就是：线刷刷机时需要通过USB数据线操作,而卡刷是通过内存卡进行操作。 关于卡刷因为在早期，安卓手机的内存普遍偏小，因此一般会通过支持内存卡的方式来让用户获得更大的存储空间。而刷机包相对于早期的手机来说，算是比较大的了，一般来说是将刷机包复制进入内存卡中，再通过REC将刷机包刷入，最终完成整个刷机操作。这里提一下，我们平时的正常情况下的手机系统升级，其实就是卡刷的一种。系统将系统更新文件下载到手机存储空间中，然后重启通过REC刷入更新的增量包或者是完整的刷机包。 温馨提示： 增量包指的是在某个特定的系统版本上更新加入某些功能的更新包，它是不带有完整的整个手机操作系统的，因此在刷机的时候是不能当作刷机包使用的。 有些手机尽管不支持内存卡，但是会将手机自带的存储空间划分一部分出来当作内存卡，这部分的空间在地位上跟内存卡是一样的，只是不能像内存卡那样取出手机进行读写操作。这种情况前两年还比较常见，现在这么操作的手机好像比较少了。 关于线刷线刷最明显的特点就是需要通过数据线来操作，因此在线刷的过程中，需要非常注意数据线和手机的连接情况，千万不能断开数据线或者是关闭计算机或者是关闭手机等。 同样地，由于线刷需要使用数据线的特点，它所能够进行的操作也就比卡刷更多，同时也更危险，比如说我们之前的刷入REC，就是通过线刷操作的。而很多情况下，手机不小心刷成砖了，救砖操作也是需要通过线刷进行的。 而现在很多手机厂商提供的官方刷机助手，都是需要连接数据线来进行操作，因此也是属于线刷。 由于现在手机已经有取消支持SD卡拓展的这个趋势，因此线刷的重要性也就凸现出来了。但是未来线刷和卡刷应该是会并存的，原因很简单：卡刷可以进行简单的刷机和系统更新等操作，线刷则可以进行更深度更敏感的操作。 什么是ROM image？对于安卓刷机来说，这个ROM image跟我们一般说的ROM是两个东西。这里我们简单地讲一下ROM和RAM这对双子星。 RAMRAM的全称是Random Access Memory，中文名是随机存取存储器，我们日常称之为运行内存。也就是说，它是不能够断电保存数据的，主要是在我们的电子产品工作的时候，将需要调用的文件预先从ROM中读取出来，放入到RAM中（因为一般来说RAM的读写速度要比ROM快），以便于我们的CPU/GPU或者是SoC等调用。 ROMROM的全称是Read-Only Memory，中文名是只读内存，就是我们平时说的手机存储空间（用来放音乐图片视频等等的那个）。也就是说，它是可以断电保存数据，主要是用来长期存储数据的。 ROM imageROM image的全称是Read-Only Memory image，简称是ROM，中文名称叫只读内存镜像，因此会有些容易跟上面的ROM混淆。这里注意，ROM image的存在形式是一个文件，相当于我们电脑平时装系统的镜像文件。 那么在安卓刷机中，我们常常用ROM来指代自己要刷入的操作系统。 什么是OS和UI？OS就是Operating System，中文名叫做操作系统。比如说我们的Windows操作系统，安卓（Android，基于Linux）操作系统，苹果操作系统（iOS，全称叫iPhone Operating System）都可以叫做OS。 而对于移动端来说，除了比较常见的Android和 iOS，还有比较小众的WindowsMobile，Sailfish（旗鱼），Ubuntu（乌班图），BlackBerry OS（黑莓）等等。 UI就是User Interface，中文名叫做用户界面。比如说我们常见的MIUI（小米），EMUI（华为，全称Emotion UI），Flyme（魅族）等等都是UI。 而一般来说，国内的安卓厂商为了做出自己的特色，都会有属于自己的UI，由于他们这些UI都是基于安卓，因此称不上是OS，只能算作UI。如果你见到名字当中有OS的（没错说的就是锤子的Smartisan OS），尽管名字里面有OS，但是还是属于UI。 由于手机厂商在UI的发力程度越来越高，修改的东西也越来越多，所以就有一种很尴尬的情况出现了，说它们是UI吧，好像又不止，说是OS吧，好像又不够格，然后就搞出了一些名词，比如说深度定制UI等等。 刷机的时候，为了方便，我们一般来说是统一使用ROM或者是刷机包来指代这些东西。 什么是砖？这里的砖跟我们平时说的搬砖的砖不是一个概念。这里的砖指的是在刷机过程中因为操作不当而无法正常使用的手机，用不了的手机跟砖头没什么区别，因此人们很形象地称之为砖。一般来说，砖也会根据手机“受内伤”的程度进行划分，一些受伤较轻的砖还是可以救回来的，而那些受伤较重的…… 什么是BL？BL简介BL的全称叫做Bootloader，中文名字叫做（小七也不知道叫什么）。一般来说，大家都认为Bootloader是嵌入式系统在通电后执行的第一段代码。 在这里用人话来说就是：手机开机要干的第一件事。 BL在功能上有些类似于我们电脑的BIOS，但是实际上两者并不完全一样，手机中是不存在BIOS这一个说法的。 BL能干什么那么要手机在通电之后（也就是我们按下开机键之后），需要干的第一件事是什么呢？打个比方来说，将军跟士兵们说要出征了，那么士兵们要干的第一件事当然是检查一下自己的装备、身体状况和精神状态有没有问题。 而对于手机来说，这里要干的事情就是初始化各个组件（屏幕、闪存、SoC、各个传感器等等），检查即将运行的固件、系统等等是否正常。 什么叫锁BL既然BL能够检查即将运行的固件和系统，那么手机厂商就能在BL上动手，直接锁死BL，使得它只能识别官方的固件和系统，从而确定手机的稳定性和安全性。但是，这也就意味着不能刷机了，因为很多官方的REC只支持官方的ROM，因此刷机很多时候第一步要做的事情就是解锁BL，而对于很多厂商来说，解锁BL意味着放弃保修，因此刷机的童鞋一定要注意。 怎么解锁BL？解锁BL的方法我们可以分为两种，官方解锁和暴力解锁。 官方解锁的意思就是通过官方渠道解锁，一般是去官网或者是官方论坛，提供手机的IMEI码等进行申请，然后就可以获得解锁BL的解锁码。 暴力解锁的意思就是非官方渠道解锁，对于一些厂商来说，它们是不会提供BL的解锁方式的，因此需要一些民间的大神破解BL，破解的途径一般是利用各种漏洞，因此这种暴力破解的方法难度要更大一些。 由于安卓机型众多，小七难免会有疏漏，小七建议童鞋们可以去自己手机对应的论坛或者是贴吧了解详细情况。 什么是REC？REC的全称叫做Recovery，直译中文名叫做恢复，百度百科有个很奇怪的翻译叫做：Android手机备份功能。 实际上，REC的功能远不止备份这么简单。进入REC模式后，我们可以通过卡刷来升级操作系统，也可以擦除（wipe）手机数据，还可以恢复出厂设置，备份当前数据等等。 由于安卓系统的复杂原理，REC所处于的分区和我们手机系统所处的分区不同，因此，如果你不小心把系统搞崩了，可以进入REC对其进行一定的修复。也就是说，因为REC和手机的ROM处于不同分区，而不同分区之间是不会互相影响的，用REC可以进行一定程度的刷机。 有些人会将REC比作我们修电脑时常用到的PE，实际上两者在地位上有些相似，但是在功能上还是有一定的差距的。 官方的REC一般限制较多（只能刷入官方的固件、补丁、更新等等），而第三方的REC则在功能上要更加丰富一些，除了能够任意刷入第三方的ROM之外，有些甚至能够支持调整分区大小、在手机上实现双系统（早期的小米手机有这个功能，现在的不太清楚）。 以前比较旧的版本的REC在刷机的时候只能通过音量键和电源键操作，并且在卡刷的时候只支持将刷机包以update的文件名，zip的文件格式放入SD卡的根目录下进行操作，现在的REC则要好很多，除了能够支持触控操作，还能刷入任意命名的刷机包。 什么是fastboot？Fastboot的功能与REC相似，但是要更为高级，更为接近系统的底层。 这句话可能比较难理解，这里简单地解释一下。更为高级的意思就是Fastboot能够执行的操作要比REC更多，比如我们之前的使用ADB刷入REC就是进入了fastboot模式执行的操作。 而更为接近系统的底层则意味着优劣共存。比如说，当你折腾手机的时候，不小心把REC搞崩了，没关系，我们还能够进入fastboot模式进行刷机，重新刷入REC，然后继续愉快地刷机。因此，几乎所有的救砖操作都是在fastboot模式下进行，但是，如果你连fastboot都进不去，那就意味着你的手机很有可能真的变砖了。 注意，我们如果使用第三方刷机软件（刷机精灵、刷机大师这些）进行一键刷机操作的时候，是属于线刷，它们会让你的手机进入fastboot模式，然后刷入这些刷机软件自己的REC，再进行刷入ROM的操作。 什么是恢复出厂设置/双清/三清？恢复出厂设置顾名思义，恢复出厂设置就是将你的手机恢复到出厂状态，也就是手机刚从工厂里面加工组装完成，包装到包装盒里面的状态。需要注意的是如果你的手机升级了系统（安卓版本更新或者是UI的大版本更新），那么恢复出厂设置之后一般是不会回退你已经更新的版本的。同时，恢复出厂设置默认不清除储存卡上的文件，且你先前做的关于设置的更改都不会保存。 双清双清和三清往往需要进入REC或者是fastboot或者是使用ADB进行操作。在REC中，一般都是wipe data和wipe cache。 wipe data/factory reset: 清除用户数据并恢复出厂设置(刷机前必须执行的选项)wipe cache partition: 清除系统缓存(刷机前执行，系统出问题也可尝试此选项,一般能够解决) 三清三清比双清多了一个清除虚拟机缓存，基本上三清已经是最彻底的清除手机数据的操作了。 wipe data/factory reset: 清除用户数据并恢复出厂设置(刷机前必须执行的选项)wipe cache partition: 清除系统缓存(刷机前执行，系统出问题也可尝试此选项,一般能够解决)wipe dalvik cache: 清空虚拟机缓存(可以解决一些程序fc的问题) 很多人在刷机前都会有双清或者是三清的习惯，这样一来可以使手机刷机更加纯净，二来也可以避免之前残留的缓存文件对新刷入的ROM产生各种莫名其妙的影响，导致出现一些奇奇怪怪的问题（比如耗电量暴增，经常卡顿等等）。现在一般三清用的不多，双清要更加多一些，原因就是三清会比较复杂，风险也比较大。 什么是OTA升级？OTA，全称为On-The-Air，中文名不详。OTA更新的原理是通过网络下载更新包，存储在手机的存储空间中，然后再重启进行升级。OTA升级在原理上是属于卡刷的。 那么我们在日常生活中哪里会接触到OTA升级呢？实际上，我们所有的官方推送的手机更新，都是属于OTA更新。而能进行OTA升级的前提条件一般都是使用的官方REC+官方ROM+没有ROOT。是否解锁BL并不影响。 什么是底包？之前我们说过，厂商可以通过锁BL的形式，使得手机只能识别官方的固件、ROM等等。那么这是不是意味着我们就不能刷机了呢？当然不是，要相信高手在民间，既然它要，我们就给它。 底包就是在这种情况下诞生的产物，它的主要目的就是使得手机能够先识别这个官方的ROM，然后我们再在这个ROM上面刷入我们自己制作的第三方ROM。 此处最典型的例子就是华为的EMUI，因为华为手机的特点，很多基于EMUI的第三方刷机包都需要基于某个特定的EMUI版本才能刷入。因此有一部分大神在制作第三方的ROM的时候，会基于官方的ROM进行修改和精简，并且加入一定的新功能。而这些制作出来的刷机包，就是需要先刷入底包的。由于华为对于刷机的支持并不友好，而且华为的主要用户群体并非是这一类的刷机发烧友，因此很多华为的机型的刷机包都是属于上述类型。 这里再额外补充一下。如果你的华为手机原来就是官方的ROM，在刷入这一类的刷机包的时候，只要你的EMUI版本符合这个第三方的刷机包的要求，是不需要刷入底包的。但是，如果你的手机已经刷入了第三方的ROM，再需要刷回这一类的ROM的时候，就需要事先刷入底包了。 什么是ADB？ADB的全称是Android Debug Bridge，中文名就是“安卓调试桥”，也就是起到了一个连接安卓手机和电脑的桥梁的作用，可以实现许多安卓手机的调试功能（此处不一一列举），因此很形象地被称呼为Android Debug Bridge。 ADB其实并非是第三方工具，它是谷歌官方出品的工具，因此最纯净的下载方式就是去谷歌官网下载（需要科学上网）。 如果你嫌去官网麻烦，可以直接打开搜索引擎下载，小心一些不要下到流氓软件则问题不大。 什么是内核？内核，顾名思义就是我们手机的核心，准确的来说是我们手机的操作系统的核心。事实上不仅是手机的操作系统，每个操作系统都有对应的核心。 那么核心主要负责什么呢？基本上，所有沟通硬件和底层驱动的任务都是由核心来负责的。而不同的核心会有不同的特性。比如说：如果你的手机耗电量比较严重，那么你就可以刷入一个第三方优化过的内核，来达到省电的效果。 什么是ROOT？ROOT在英语里面有根源的意思，而在安卓手机中，ROOT则意味着获取手机系统的最高权限，也就是相当于手机系统的超级管理员，能够执行一切操作，包括但不限于修改系统底层文件，后台安装应用程序，自动发送扣费短信等等，因此对于不知道如何使用ROOT权限的小白来说风险还是相当大的。 但是ROOT作为一把双刃剑，有坏也有好。修改系统文件虽然有可能导致系统损坏，但是也可以解锁一些手机在出厂时因为各种原因被手机厂商锁死的功能，又或者是卸载一些没用的系统软件，让手机从臃肿变得清爽。 因此关键还是看你怎么使用它。 什么是Xposed？Xposed是一个框架，它本身是不具备具体的功能的。但是有很多模块可以通过在Xposed框架上运行，实现一些很有意思的功能如各种个性化的手机定制。 因此，打个比方来说就是：Xposed本身相当于是一个容器，是用来装东西的，放米就成了米缸，放水就成了水缸，放木炭硫磺硝酸钾就成了炸弹。","categories":[{"name":"科普","slug":"科普","permalink":"http://www.tiny777.com/categories/科普/"}],"tags":[{"name":"安卓","slug":"安卓","permalink":"http://www.tiny777.com/tags/安卓/"},{"name":"3C","slug":"3C","permalink":"http://www.tiny777.com/tags/3C/"}]},{"title":"CHKDSK使用方法","slug":"CHKDSK","date":"2017-05-02T16:00:00.000Z","updated":"2018-07-16T12:13:33.926Z","comments":true,"path":"2017/05/03/CHKDSK/","link":"","permalink":"http://www.tiny777.com/2017/05/03/CHKDSK/","excerpt":"前面小七给童鞋们介绍了关闭硬盘开机自检的方法，那么遇到一些特殊情况，需要手动检查硬盘的健康状况，有没有一些简单的方法呢？ 那么在这里小七给童鞋们介绍一下Windows自带的硬盘检测和修复工具CHKDSK。","text":"前面小七给童鞋们介绍了关闭硬盘开机自检的方法，那么遇到一些特殊情况，需要手动检查硬盘的健康状况，有没有一些简单的方法呢？ 那么在这里小七给童鞋们介绍一下Windows自带的硬盘检测和修复工具CHKDSK。 CHKDSK是什么？CHKDSK，就是CHECK DISK的缩写，中文名就是磁盘检查。 这个工具是Windows系统中自带的一个简单实用的硬盘检错和修复工具，用于验证文件系统的逻辑完整性。 如果 CHKDSK 在文件系统数据中发现存在逻辑不一致性，CHKDSK 将执行可修复该文件系统数据的操作（前提是这些数据未处于只读模式）。 小七注：只读模式即只能对文件进行读取操作而无法对其进行修改。 如何使用CHKDSK检测磁盘？注意事项 ①不要中断CHKDSK的运行 原因很简单：医生在给病人做手术的时候不能被中断。CHKDSK在运行过程中，视磁盘的情况不同，所需时间长短也可能会有很大的差异，因此请保持耐心。 ②如果需要修复磁盘错误，确保被修复的磁盘没有文件被打开 如果有文件被打开了，在修复之前CHKDSK会报错。因此如果不能确定是什么文件被打开，最好进入DOS环境操作。 步骤如下以系统管理员身份运行CMD由于对硬盘的检测操作需要系统管理员的权限，而一般在运行窗口中运行CMD是没有系统管理员权限的。因此我们需要在这个目录下找到CMD，并且将他发送到桌面快捷方式以便于操作，目录：C:\\Windows\\System32。 运行的时候，不要直接双击运行，右键菜单点击以管理员身份运行。 输入命令①直接输入 chkdsk X：/f 小七注：X为所需要检测修复的硬盘盘符，chkdsk和盘符X之间有一个空格，其余均无空格，所有符号请在英文半角下输入，也就是使用英文键盘，不要使用中文输入法。 ②直接按下回车，即会自动开始检测如果检测出磁盘错误，会自动修复(一般修复分为三个阶段），如果没有检测出问题，则如下图：（图中的D盘是小七的一个U盘） 如何检测系统盘？特别的，当你检测的是系统盘C盘时，由于此时正处于操作系统界面下，无法进行检测操作，所以询问你是否在下次启动系统时进行检测。 输入Y后回车，然后重启即可。 什么情况下需要用到CHKDSK？由于情况较多，下面只列举三种比较常见的情况。 系统直接提醒系统直接提醒你的时候，这种情况会比较严重，如果你的系统某个或者某些文件出现了问题，系统弹出提示框让你运行chkdsk工具进行检测，那么就可以照着上面的教程进行操作 移动设备提示有错误移动设备（U盘，移动硬盘等）插入电脑时提示有出现错误，系统询问你是否需要扫描并修复时，也可以使用这个，当然你也可以直接让系统来执行； 非法操作之后你的硬盘关闭了开机自检而且你对系统进行了非法操作（强制关机等）的时候，系统盘既有可能会出现错误或者是冗余文件。这个时候运行chkdsk工具，则会帮你处理掉这些冗余文件，所以有些童鞋在有时候在运行完chkdsk工具后会发现自己的硬盘的可用空间增多了，就是这个原因 CHKDSK全部指令最后放出CHKDSK的全部命令，有兴趣的童鞋可以研究研究。","categories":[{"name":"教程","slug":"教程","permalink":"http://www.tiny777.com/categories/教程/"}],"tags":[{"name":"硬盘","slug":"硬盘","permalink":"http://www.tiny777.com/tags/硬盘/"}]},{"title":"关闭硬盘开机自检","slug":"DISADPOST","date":"2017-05-01T16:00:00.000Z","updated":"2018-07-16T12:15:22.324Z","comments":true,"path":"2017/05/02/DISADPOST/","link":"","permalink":"http://www.tiny777.com/2017/05/02/DISADPOST/","excerpt":"相信有很多电脑都可能会出现开机硬盘自检的情况，那么其实对于大部分同学来说，开机自检有没有必要呢？","text":"相信有很多电脑都可能会出现开机硬盘自检的情况，那么其实对于大部分同学来说，开机自检有没有必要呢？ 引言其实，开机硬盘自检的存在是有一定的道理的，因为很多电脑的硬盘（尤其是机械硬盘）可能由于使用者的一些不当操作，而产生各种各样奇奇怪怪的问题。 这个时候，硬盘的开机自检就能够发挥作用，在一定程度上缓解这些问题，或者说是，预防这些问题。 因此小七的建议是：硬盘自检，能不关就不关。 小七注：奇奇怪怪的问题包括但不限于：系统文件丢失、引导文件丢失、硬盘产生坏道等等。硬盘坏道是物理级别的损伤，只能屏蔽坏道或者是更换硬盘，无法修复。 但是总会因为各种需要而要关闭硬盘自检，小七在这里给大家分享一个通过修改注册表来关闭硬盘开机自检的方法。 ▲如图所示为戴尔笔记本的开机硬盘自检 打开注册表编辑器①在任意情况下，我们直接同时按下windows键（开始菜单键）和字母键R，此时会出现一个运行窗口 ②然后我们在里面输入regedit（如上图所示），回车即可打开注册表编辑器（如下图所示） 小七注： 注册表编辑器中包含有全部系统设置及软件的有关信息，在不确定的情况下，请不要随意进行更改，注册表一旦损坏且如无事先备份，后果不堪设想 Win+R是系统级别的快捷键，可以直接打开运行窗口，因此无论你处于任何应用窗口都可以直接使用此快捷键。 定位到 BootExecute①根据这个地址，找到Session Manager中的BootExecute HKEY_LOCAL_MACHINE → SYSTEM → ControlSet001 → Control → Session Manager ②如下图所示，右键BootExecute，点击修改 清空数值①清空里面的数值autocheck autochk * ②点击确定 到这里，硬盘自检就已经被关闭了，如果想要重新开启，只需要将数值重新修改为autocheck autochk *即可。","categories":[{"name":"教程","slug":"教程","permalink":"http://www.tiny777.com/categories/教程/"}],"tags":[{"name":"硬盘","slug":"硬盘","permalink":"http://www.tiny777.com/tags/硬盘/"},{"name":"笔记本","slug":"笔记本","permalink":"http://www.tiny777.com/tags/笔记本/"}]}]}